/* Create Table.sql
CHECK constraint ជាក្រិតក្រមដាក់លើជួរឈរ ដើម្បីធានាថាតម្លៃរបស់ជួរឈរ ស្របតាមលក្ខខណ្ឌបានកំណត់
បើមិនអ៊ីចឹងទេ នឹងបអង្ហាញឃ្លាកំហុសឆ្គង។
ឧទាហរណ៍
	ក្នុងមូលទិន្នន័យ SLS ស្នើបង្កើតតារាងដើម្បីរក្សាទុកព័ត៌មាននិស្សិតដែលមានទិន្នន័យមួយចំនួនដូចជា៖
		លេខសម្គាល់និស្សិត StudentID ជាលេខចំនួនគត់ធំបំផុត
		ឈ្មោះសម្គាល់និស្សិត StudentName ជាឃ្លាអាចមានអក្សររហូតដល់៣០តួរ និង ចាំបាច់
		ភេទ Sex ជាអក្សរមួយតួ តែមានតម្លៃមួយក្នុងចំណោមពីរគឺ M រឺ F និងចាំបាច់
		កម្ពស់ Height ជាលេខចំនួនគត់តូចបំផុត ដែលមានតម្លៃចាប់ពី 250 ដល់ 199 Cm និង ចាំបាច់។	  */
CREATE TABLE Student (
	StudentID INT,
	StudentName VARCHAR(30) NOT NULL,
	SEX CHAR(1) CHECK (Sex='M' OR Sex='F'),
	Height TINYINT CHECK (Height>=150 and Height <= 199) NOT NULL,
);
